
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.civil_db_username__v15_secret
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_key_vault_secret.civil_db_password__v15_secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "app_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "civil-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # azurerm_key_vault_secret.civil_db_password__v15_secret must be replaced
-/+ resource "azurerm_key_vault_secret" "civil_db_password__v15_secret" {
      ~ id                      = "https://civil-aat.vault.azure.net/secrets/cmc-db-username-v15/b9803aa026114b11987b15e8e0afe5ec" -> (known after apply)
      ~ name                    = "cmc-db-username-v15" -> "cmc-db-password-v15" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/cmc-db-username-v15/versions/b9803aa026114b11987b15e8e0afe5ec" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/cmc-db-username-v15" -> (known after apply)
        tags                    = {
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "Vault cmc-aat"
        }
      ~ version                 = "b9803aa026114b11987b15e8e0afe5ec" -> (known after apply)
      ~ versionless_id          = "https://civil-aat.vault.azure.net/secrets/cmc-db-username-v15" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.civil_db_username__v15_secret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "civil_db_username__v15_secret" {
        id                      = "https://civil-aat.vault.azure.net/secrets/cmc-db-username-v15/16427fcbb68d4ee782216a36259a09ee"
        name                    = "cmc-db-username-v15"
        tags                    = {
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "Vault cmc-aat"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat|civil-aat"
        name                           = "civil-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":3620,"Program":"tfcmt","SHA1":"","Vars":{}} -->